---
kind: enumMember
id: F:Autodesk.Revit.DB.Macros.DocumentMacroOptions.EnableMacros
enum: Autodesk.Revit.DB.Macros.DocumentMacroOptions
source: html/718074d4-9235-9eb1-c8b1-e1d4bb9dddc6.htm
---
# Autodesk.Revit.DB.Macros.DocumentMacroOptions.EnableMacros

The option to enable macros in the document.